# NumberingSchemaTypes.StructuralNumberingSchemas Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
NumberingSchemaTypes..::..StructuralNumberingSchemas Members
NumberingSchemaTypes..::..StructuralNumberingSchemas Class Properties See Also
---
Provides a container of all Revit built-in NumberingSchemaType instances.
The NumberingSchemaTypes..::..StructuralNumberingSchemas type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Rebar | Built-in schema used for numbering rebar elements |
| RebarCoupler | Built-in schema used for numbering rebar coupler elements |
| ReinforcementFabric | Built-in schema used for numbering fabric reinforcement elements |

# See Also
NumberingSchemaTypes..::..StructuralNumberingSchemas Class
Autodesk.Revit.DB Namespace